{
  "id": "c82cb178-c650-4446-9885-7e5fa10d982a",
  "templateId": null,
  "displayName": "CA003: Sign-in every hour for admin accounts",
  "createdDateTime": "2023-03-09T20:04:28.9558249Z",
  "modifiedDateTime": "2023-07-10T10:04:44.1790204Z",
  "state": "enabledForReportingButNotEnforced",
  "grantControls": null,
  "partialEnablementStrategy": null,
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "all"
    ],
    "platforms": null,
    "locations": null,
    "times": null,
    "deviceStates": null,
    "devices": null,
    "clientApplications": null,
    "applications": {
      "includeApplications": [
        "All"
      ],
      "excludeApplications": [],
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences": [],
      "applicationFilter": null
    },
    "users": {
      "includeUsers": [
        "All"
      ],
      "excludeUsers": [
        "8ded1076-6d24-4054-8cec-636ec79f4fa7"
      ],
      "includeGroups": [],
      "excludeGroups": [],
      "includeRoles": [
        "0526716b-113d-4c15-b2c8-68e3c22b9f80",
        "17315797-102d-40b4-93e0-432062caca18",
        "194ae4cb-b126-40b2-bd5b-6091b380977d",
        "29232cdf-9323-42fd-ade2-1d097af3e4de",
        "3a2c62db-5318-420d-8d74-23affee5d9d5",
        "62e90394-69f5-4237-9190-012177145e10",
        "69091246-20e8-4a56-aa4d-066075b2a7a8",
        "7698a772-787b-4ac8-901f-60d6b08affd2",
        "9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3",
        "f28a1f50-f6e7-4571-818b-6a12f2af6b6c",
        "fdd7a751-b60b-444a-984c-02652fe8fa1c",
        "fe930be7-5e62-47db-91af-98c3a49a38b1"
      ],
      "excludeRoles": [],
      "includeGuestsOrExternalUsers": null,
      "excludeGuestsOrExternalUsers": null
    }
  },
  "sessionControls": {
    "disableResilienceDefaults": null,
    "applicationEnforcedRestrictions": null,
    "cloudAppSecurity": null,
    "continuousAccessEvaluation": null,
    "secureSignInSession": null,
    "signInFrequency": {
      "value": 1,
      "type": "hours",
      "authenticationType": "primaryAndSecondaryAuthentication",
      "frequencyInterval": "timeBased",
      "isEnabled": true
    },
    "persistentBrowser": {
      "mode": "never",
      "isEnabled": true
    }
  }
}
