{
  "id": "d05501ec-f448-49f7-a749-e3ea73279d1b",
  "templateId": null,
  "displayName": "CA101: Require multifactor authentication for all users exclude trusted locations",
  "createdDateTime": "2023-03-17T12:30:18.6480751Z",
  "modifiedDateTime": null,
  "state": "enabledForReportingButNotEnforced",
  "partialEnablementStrategy": null,
  "sessionControls": null,
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "all"
    ],
    "platforms": null,
    "times": null,
    "deviceStates": null,
    "devices": null,
    "clientApplications": null,
    "applications": {
      "includeApplications": [
        "All"
      ],
      "excludeApplications": [],
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences": [],
      "applicationFilter": null
    },
    "users": {
      "includeUsers": [
        "All"
      ],
      "excludeUsers": [
        "602b7044-910a-4155-b3fd-bd36ae7d1e1a"
      ],
      "includeGroups": [],
      "excludeGroups": [],
      "includeRoles": [],
      "excludeRoles": [],
      "includeGuestsOrExternalUsers": null,
      "excludeGuestsOrExternalUsers": null
    },
    "locations": {
      "includeLocations": [
        "All"
      ],
      "excludeLocations": [
        "AllTrusted"
      ]
    }
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "mfa"
    ],
    "customAuthenticationFactors": [],
    "termsOfUse": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('d05501ec-f448-49f7-a749-e3ea73279d1b')/grantControls/authenticationStrength/$entity",
    "authenticationStrength": null
  }
}
