{
  "id": "0dc9bee2-ccf1-47a0-ade8-ba74fc16b2f7",
  "templateId": null,
  "displayName": "CA103: Require approved client apps and app protection for all users",
  "createdDateTime": "2023-03-17T12:30:19.9739979Z",
  "modifiedDateTime": null,
  "state": "enabledForReportingButNotEnforced",
  "partialEnablementStrategy": null,
  "sessionControls": null,
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "all"
    ],
    "locations": null,
    "times": null,
    "deviceStates": null,
    "devices": null,
    "clientApplications": null,
    "applications": {
      "includeApplications": [
        "All"
      ],
      "excludeApplications": [],
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences": [],
      "applicationFilter": null
    },
    "users": {
      "includeUsers": [
        "All"
      ],
      "excludeUsers": [],
      "includeGroups": [],
      "excludeGroups": [],
      "includeRoles": [],
      "excludeRoles": [],
      "includeGuestsOrExternalUsers": null,
      "excludeGuestsOrExternalUsers": null
    },
    "platforms": {
      "includePlatforms": [
        "android",
        "iOS"
      ],
      "excludePlatforms": []
    }
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "approvedApplication",
      "compliantApplication"
    ],
    "customAuthenticationFactors": [],
    "termsOfUse": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('0dc9bee2-ccf1-47a0-ade8-ba74fc16b2f7')/grantControls/authenticationStrength/$entity",
    "authenticationStrength": null
  }
}
