{
  "id": "0987fc85-8c0b-4692-b0e6-2cdae88736eb",
  "templateId": null,
  "displayName": "CA202: Require app protection policy with mobile devices",
  "createdDateTime": "2023-04-02T07:48:10.1949121Z",
  "modifiedDateTime": "2023-04-02T07:48:40.4895438Z",
  "state": "enabledForReportingButNotEnforced",
  "partialEnablementStrategy": null,
  "sessionControls": null,
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "all"
    ],
    "locations": null,
    "times": null,
    "deviceStates": null,
    "devices": null,
    "clientApplications": null,
    "applications": {
      "includeApplications": [
        "All"
      ],
      "excludeApplications": [],
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences": [],
      "applicationFilter": null
    },
    "users": {
      "includeUsers": [
        "All"
      ],
      "excludeUsers": [],
      "includeGroups": [],
      "excludeGroups": [],
      "includeRoles": [],
      "excludeRoles": [],
      "includeGuestsOrExternalUsers": null,
      "excludeGuestsOrExternalUsers": null
    },
    "platforms": {
      "includePlatforms": [
        "android",
        "iOS"
      ],
      "excludePlatforms": []
    }
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "compliantApplication"
    ],
    "customAuthenticationFactors": [],
    "termsOfUse": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('0987fc85-8c0b-4692-b0e6-2cdae88736eb')/grantControls/authenticationStrength/$entity",
    "authenticationStrength": null
  }
}
